TDPortal/Utilities/EnhancedExposedServicesTestTool/ExposedServicesTestToolClient/Requests/CycleJourneyPlannerSynchronous/V1/PlanCycleJourney - Result - CycleParameters.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
	<PlanCycleJourney xmlns="http://www.transportdirect.info/TransportDirect.EnhancedExposedServices.CycleJourneyPlannerSynchronous.V1">
      <transactionId>testCycleJourneyPlanner</transactionId>
      <request>
        <JourneyRequest>
          <JourneyRequestId>01</JourneyRequestId>
          <OriginLocation>
            <Description>DE1</Description>
			<Type>Coordinate</Type>
			<GridReference>
				<Easting>432950</Easting>
				<Northing>334120</Northing>
			</GridReference>
          </OriginLocation>
          <DestinationLocation>
            <Description>De3</Description>
			<Type>Coordinate</Type>
			<GridReference>
				<Easting>430571</Easting>
				<Northing>334539</Northing>
			</GridReference>
          </DestinationLocation>
          <ViaLocation>
			<Description />
			<Type>Coordinate</Type>
			<GridReference>
				<Easting>0</Easting>
				<Northing>0</Northing>
			</GridReference>
		  </ViaLocation>
          <OutwardDateTime>2014-04-30T15:35:00.0000+01:00</OutwardDateTime>
          <OutwardArriveBefore>false</OutwardArriveBefore>
        </JourneyRequest>
		<CycleParameters>
          <Algorithm>Call td.cp.CyclePenaltyFunctions.v2.dll,QuickestV912</Algorithm>
          <RequestPreferences>
			<RequestPreference>
				<PreferenceId>5</PreferenceId>
				<PreferenceValue>19</PreferenceValue>
            </RequestPreference>
          </RequestPreferences>
        </CycleParameters>
        <ResultSettings>
          <IncludeGeometry>true</IncludeGeometry>
          <PointSeparator>61</PointSeparator>
          <EastingNorthingSeparator>75</EastingNorthingSeparator>
          <DistanceUnit>Miles</DistanceUnit>
          <Language>en-GB</Language>
        </ResultSettings>
      </request>
    </PlanCycleJourney>
  </soap:Body>
</soap:Envelope>
